In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [2]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [3]:
df["Age"].fillna(df["Age"].mean(),inplace=True)
df["Age"].isna().sum()

0

In [4]:
movie_dict = {"Movies":["Interstellar","Avengers","Dhoom","Interstellar"],
"Genre":["fiction","Fiction","Comedy","fiction"],
"Actors":["American","French","Indian","American"]}
index_labels = ["a","b","c","d"]
df = pd.DataFrame(movie_dict,index=index_labels)
df

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian
d  Interstellar  fiction  American

In [5]:
df.head(3)

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian

In [6]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [7]:
df.loc[:1 , ["Name","Age","Gender"]]

                                                Name   Age  Gender
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female

In [8]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [9]:
df.loc[[0,1,2,3,5,7,9] , ["Name","Age","Gender"]]

                                                Name   Age  Gender
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina   NaN  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   NaN  female
5                                   Moran, Mr. James   NaN    male
7                     Palsson, Master. Gosta Leonard   2.0    male
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0  female

In [10]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [11]:
df.isna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False,True,False
3,False,False,False,False,False,True,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [12]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False,True,False
3,False,False,False,False,False,True,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [13]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [14]:
df.isnull().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [15]:
df.dropna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [16]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [17]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [18]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [19]:
df.isna().sum().sum()

869

In [20]:
df["Age"] = df["Age"].fillna(40)
df["Age"].isna().sum()

0

In [21]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [22]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [23]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [24]:
df["Age"].fillna(df["Age"].mean() , inplace=True)
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [25]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [26]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [27]:
result = df["Age"].isna().to_numpy().nonzero()
result

(array([  2,   3,   4,   5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
         45,  46,  47,  48,  55,  64,  65,  76,  77,  82,  87,  95, 101,
        107, 109, 121, 126, 128, 140, 154, 158, 159, 166, 168, 176, 180,
        181, 185, 186, 196, 198, 201, 214, 223, 229, 235, 240, 241, 250,
        256, 260, 264, 270, 274, 277, 284, 295, 298, 300, 301, 303, 304,
        306, 324, 330, 334, 335, 347, 351, 354, 358, 359, 364, 367, 368,
        375, 384, 388, 409, 410, 411, 413, 415, 420, 425, 428, 431, 444,
        451, 454, 457, 459, 464, 466, 468, 470, 475, 481, 485, 490, 495,
        497, 502, 507, 511, 517, 522, 524, 527, 531, 533, 538, 547, 552,
        557, 560, 563, 564, 568, 573, 578, 584, 589, 593, 596, 598, 601,
        602, 611, 612, 613, 629, 633, 639, 643, 648, 650, 653, 656, 667,
        669, 674, 680, 692, 697, 709, 711, 718, 727, 732, 738, 739, 740,
        760, 766, 768, 773, 776, 778, 783, 790, 792, 793, 815, 825, 826,
        828, 832, 837, 839, 846, 849, 859, 863, 868, 878, 888], dtype=int64),)

In [28]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [29]:
female = df.groupby(df["Gender"]).get_group("female")
female

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [30]:
s = df.groupby(df["Embarked"]).get_group("S")
s

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [31]:
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [32]:
df = pd.read_csv("diabetes.csv")
df.head(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1

In [33]:
df.loc[: , ["Age","Outcome","BMI","Glucose"]]

     Age  Outcome   BMI  Glucose
0     50        1  33.6      148
1     31        0  26.6       85
2     52        1  23.3      183
3     21        0  28.1      150
4     33        1  43.1      150
..   ...      ...   ...      ...
763   63        0  32.9      101
764   27        0  36.8      122
765   30        0  26.2      121
766   47        1  30.1      126
767   23        0  30.4       93

[768 rows x 4 columns]

In [34]:
df.reindex(["Age","Outcome","BMI"],axis=1)

     Age  Outcome   BMI
0     50        1  33.6
1     31        0  26.6
2     52        1  23.3
3     21        0  28.1
4     33        1  43.1
..   ...      ...   ...
763   63        0  32.9
764   27        0  36.8
765   30        0  26.2
766   47        1  30.1
767   23        0  30.4

[768 rows x 3 columns]

In [35]:
df = pd.read_csv("student.csv")
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [36]:
df.loc[35] = [36,"Honny","five",45,"male"]
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36        Honny   five    45    male

In [37]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [38]:
df.drop((df.loc[(df["mark"] < 50)]).index)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [39]:
df.iloc[[5],]

   id       name class  mark gender
5   6  Alex John  Four    55   male

In [40]:
df.iloc[:5]

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [41]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [42]:
class1 = {class1 : len(class1) for class1 in df["class"]}
class1

{'Four': 4,
 'Three': 5,
 'Fifth': 5,
 'Five': 4,
 'Six': 3,
 'Seven': 5,
 'Nine': 4,
 'Eight': 5,
 'five': 4}

In [43]:
class1 = {class1 : len(class1) for class1 in df["class"]}
class1

{'Four': 4,
 'Three': 5,
 'Fifth': 5,
 'Five': 4,
 'Six': 3,
 'Seven': 5,
 'Nine': 4,
 'Eight': 5,
 'five': 4}

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("student.csv")
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [2]:
df["name"] = df["name"].apply(lambda x : x.lower())
df

    id         name  class  mark  gender
0    1     john deo   Four    75  female
1    2     max ruin  Three    85    male
2    3       arnold  Three    55    male
3    4   krish star   Four    60  female
4    5    john mike   Four    60  female
5    6    alex john   Four    55    male
6    7  my john rob  Fifth    78    male
7    8       asruid   Five    85    male
8    9      tes qry    Six    78    male
9   10     big john   Four    55  female
10  11       ronald    Six    89  female
11  12        recky    Six    94  female
12  13          kty  Seven    88  female
13  14         bigy  Seven    88  female
14  15     tade row   Four    88    male
15  16        gimmy   Four    88    male
16  17        tumyu    Six    54    male
17  18        honny   Five    75    male
18  19        tinny   Nine    18    male
19  20       jackly   Nine    65  female
20  21   babby john   Four    69  female
21  22       reggid  Seven    55  female
22  23        herod  Eight    79    male
23  24    tiddy now  Seven    78    male
24  25     giff tow  Seven    88    male
25  26       crelea  Seven    79    male
26  27     big nose  Three    81  female
27  28    rojj base  Seven    86  female
28  29  tess played  Seven    55    male
29  30    reppy red    Six    79  female
30  31  marry toeey   Four    88    male
31  32    binn rott  Seven    90  female
32  33    kenn rein    Six    96  female
33  34     gain toe  Seven    69    male
34  35   rows noump    Six    88  female

In [3]:
list1 = ['Amir ',' Ashwin',' Bhakti ',' Amol','Aishwarya ','Satyam ']
s1 = pd.Series(list1)
s1

0         Amir
1        Ashwin
2       Bhakti
3          Amol
4    Aishwarya
5       Satyam
dtype: object

In [4]:
s1 = s1.apply(lambda x : x.strip())
s1

0         Amir
1       Ashwin
2       Bhakti
3         Amol
4    Aishwarya
5       Satyam
dtype: object

In [5]:
s1.to_numpy().tolist()

['Amir', 'Ashwin', 'Bhakti', 'Amol', 'Aishwarya', 'Satyam']

In [6]:
data = {'year': [1700, 1850, 2000, 2300, 1950]}
df = pd.DataFrame(data)
print(df)
result = df[(df["year"] >= 1800) & (df["year"] <= 2200)]
result

   year
0  1700
1  1850
2  2000
3  2300
4  1950

   year
1  1850
2  2000
4  1950

In [7]:
df1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'),index=list('pqr'))
df2 = pd.DataFrame(np.random.randint(100,1000,(4,4)),columns=list('ABCD'),index=list('pqrs'))
df1

   A  B  C
p  2  4  3
q  8  1  2
r  1  6  9

In [8]:
df2

     A    B    C    D
p  787  306  290  974
q  857  391  983  314
r  155  672  881  277
s  951  227  197  382

In [10]:
pd.concat([df1,df2])

     A    B    C      D
p    2    4    3    NaN
q    8    1    2    NaN
r    1    6    9    NaN
p  787  306  290  974.0
q  857  391  983  314.0
r  155  672  881  277.0
s  951  227  197  382.0

In [11]:
pd.concat([df1,df2],axis=1)

     A    B    C    A    B    C    D
p  2.0  4.0  3.0  787  306  290  974
q  8.0  1.0  2.0  857  391  983  314
r  1.0  6.0  9.0  155  672  881  277
s  NaN  NaN  NaN  951  227  197  382

In [13]:
df1=pd.DataFrame({"Name":["Aarathi","Veena","Lakshmipriya","Sriyan"],
"Age":[23,54,34,67],
"Location":["Pune","Bangalore","Pune","Kochi"]})
df2=pd.DataFrame({"Name":["Aara","Anupama","Robin","Dilsha","Ramya"],
"Age":[23,54,34,67,45],
"Maths":[34,45,50,49,46],
"English":[50,49,48,34,89],
"Hindi":[40,45,50,34,67]})
df3=pd.DataFrame({"Name":["Aarathi","Veena","Sriyan","Dilsha","Arohi"],
"Salary":[80000,70000,90000,780000,90000]})
df1

           Name  Age   Location
0       Aarathi   23       Pune
1         Veena   54  Bangalore
2  Lakshmipriya   34       Pune
3        Sriyan   67      Kochi

In [14]:
df2

      Name  Age  Maths  English  Hindi
0     Aara   23     34       50     40
1  Anupama   54     45       49     45
2    Robin   34     50       48     50
3   Dilsha   67     49       34     34
4    Ramya   45     46       89     67

In [15]:
df3

      Name  Salary
0  Aarathi   80000
1    Veena   70000
2   Sriyan   90000
3   Dilsha  780000
4    Arohi   90000

In [16]:
result = pd.concat([df1,df2])
result

           Name  Age   Location  Maths  English  Hindi
0       Aarathi   23       Pune    NaN      NaN    NaN
1         Veena   54  Bangalore    NaN      NaN    NaN
2  Lakshmipriya   34       Pune    NaN      NaN    NaN
3        Sriyan   67      Kochi    NaN      NaN    NaN
0          Aara   23        NaN   34.0     50.0   40.0
1       Anupama   54        NaN   45.0     49.0   45.0
2         Robin   34        NaN   50.0     48.0   50.0
3        Dilsha   67        NaN   49.0     34.0   34.0
4         Ramya   45        NaN   46.0     89.0   67.0

In [17]:
final = pd.merge(result,df3,on="Name")
final

      Name  Age   Location  Maths  English  Hindi  Salary
0  Aarathi   23       Pune    NaN      NaN    NaN   80000
1    Veena   54  Bangalore    NaN      NaN    NaN   70000
2   Sriyan   67      Kochi    NaN      NaN    NaN   90000
3   Dilsha   67        NaN   49.0     34.0   34.0  780000

In [18]:
df1 = pd.DataFrame({"Name":["Aarathi","Veena","Lakshmipriya","Amit","Sriyan"],
"ID_card":['BSL004','BSL006','BSL010','BSL003','BSL007'],
"Physics":[94,86,73,96,75],
"Cemistry":[85,91,89,78,81]})
df2 = pd.DataFrame({"Name":["Aarathi","Veena","Manoj","Lakshmipriya","Sriyan"],
"ID_card":['BSL001','BSL005','BSL009','BSL008','BSL002'],
"Maths":[88,72,69,97,45],
"Biology":[98,75,86,61,64]})
df1

           Name ID_card  Physics  Cemistry
0       Aarathi  BSL004       94        85
1         Veena  BSL006       86        91
2  Lakshmipriya  BSL010       73        89
3          Amit  BSL003       96        78
4        Sriyan  BSL007       75        81

In [19]:
df2

           Name ID_card  Maths  Biology
0       Aarathi  BSL001     88       98
1         Veena  BSL005     72       75
2         Manoj  BSL009     69       86
3  Lakshmipriya  BSL008     97       61
4        Sriyan  BSL002     45       64

In [20]:
result = pd.merge(df1,df2 ,on="Name",suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004       94        85      BSL001     88       98
1         Veena      BSL006       86        91      BSL005     72       75
2  Lakshmipriya      BSL010       73        89      BSL008     97       61
3        Sriyan      BSL007       75        81      BSL002     45       64

In [21]:
result = pd.merge(df1,df2 ,on="Name",how="left")
result

           Name ID_card_x  Physics  Cemistry ID_card_y  Maths  Biology
0       Aarathi    BSL004       94        85    BSL001   88.0     98.0
1         Veena    BSL006       86        91    BSL005   72.0     75.0
2  Lakshmipriya    BSL010       73        89    BSL008   97.0     61.0
3          Amit    BSL003       96        78       NaN    NaN      NaN
4        Sriyan    BSL007       75        81    BSL002   45.0     64.0

In [22]:
result = pd.merge(df1,df2 ,on="Name",how="left",suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004       94        85      BSL001   88.0     98.0
1         Veena      BSL006       86        91      BSL005   72.0     75.0
2  Lakshmipriya      BSL010       73        89      BSL008   97.0     61.0
3          Amit      BSL003       96        78         NaN    NaN      NaN
4        Sriyan      BSL007       75        81      BSL002   45.0     64.0

In [23]:
result = pd.merge(df1,df2 ,how="right")
result

           Name ID_card  Physics  Cemistry  Maths  Biology
0       Aarathi  BSL001      NaN       NaN     88       98
1         Veena  BSL005      NaN       NaN     72       75
2         Manoj  BSL009      NaN       NaN     69       86
3  Lakshmipriya  BSL008      NaN       NaN     97       61
4        Sriyan  BSL002      NaN       NaN     45       64

In [24]:
result = pd.merge(df1,df2 ,on="Name",how="right",suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004     94.0      85.0      BSL001     88       98
1         Veena      BSL006     86.0      91.0      BSL005     72       75
2         Manoj         NaN      NaN       NaN      BSL009     69       86
3  Lakshmipriya      BSL010     73.0      89.0      BSL008     97       61
4        Sriyan      BSL007     75.0      81.0      BSL002     45       64

In [25]:
english_df = pd.DataFrame({'Name':['Amir','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Arkar','Mulla','Surve','Kadvekar','Antule'],
'Marks':[94,86,91,93,88]})
maths_df = pd.DataFrame({'Name':['Amir','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Khan','Mulla','Hafiz','Kadvekar','Shaikh'],
'Marks':[91,89,93,87,84]})
english_df

     Name   Surname  Marks
0    Amir     Arkar     94
1  Salman     Mulla     86
2    Maaz     Surve     91
3  Tanvir  Kadvekar     93
4   Fahad    Antule     88

In [27]:
maths_df

     Name   Surname  Marks
0    Amir      Khan     91
1  Salman     Mulla     89
2    Maaz     Hafiz     93
3  Tanvir  Kadvekar     87
4   Fahad    Shaikh     84

In [29]:
result = pd.merge(english_df,maths_df,how="inner",on=["Name","Surname"],suffixes=["_df1","_df2"])
result

     Name   Surname  Marks_df1  Marks_df2
0  Salman     Mulla         86         89
1  Tanvir  Kadvekar         93         87

In [30]:
physics_df = pd.DataFrame({'Name_1':['Amir','Salman','Maaz','Karim','Fahad'],
'Surname':['Arkar','Mulla','Surve','Kadvekar','Antule'],
'Marks':[94,86,91,93,88]})
chemistry_df = pd.DataFrame({'Name_2':['Asif','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Khan','Mulla','Hafiz','Rawal','Shaikh'],
'Marks':[91,89,93,87,84]})
physics_df

   Name_1   Surname  Marks
0    Amir     Arkar     94
1  Salman     Mulla     86
2    Maaz     Surve     91
3   Karim  Kadvekar     93
4   Fahad    Antule     88

In [31]:
chemistry_df

   Name_2 Surname  Marks
0    Asif    Khan     91
1  Salman   Mulla     89
2    Maaz   Hafiz     93
3  Tanvir   Rawal     87
4   Fahad  Shaikh     84

In [34]:
result = pd.merge(physics_df,chemistry_df,how="inner",left_on="Name_1",right_on="Name_2",suffixes=["_1","_2"])
result

   Name_1 Surname_1  Marks_1  Name_2 Surname_2  Marks_2
0  Salman     Mulla       86  Salman     Mulla       89
1    Maaz     Surve       91    Maaz     Hafiz       93
2   Fahad    Antule       88   Fahad    Shaikh       84

In [2]:
import pandas as pd 
import numpy as np
df = pd.read_csv("movies_data.csv")
df.head(3)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [3]:
result = df.sort_values("duration",ignore_index=True,ascending=False)
result

,star_rating,title,content_rating,genre,duration,actors_list
0,7.8,Hamlet,PG-13,Drama,242,"[u'Kenneth Branagh', u'Julie Christie', u'Dere..."
1,8.2,Gone with the Wind,G,Drama,238,"[u'Clark Gable', u'Vivien Leigh', u'Thomas Mit..."
2,8.4,Once Upon a Time in America,R,Crime,229,"[u'Robert De Niro', u'James Woods', u'Elizabet..."
3,8.3,Lagaan: Once Upon a Time in India,PG,Adventure,224,"[u'Aamir Khan', u'Gracy Singh', u'Rachel Shell..."
4,7.9,The Ten Commandments,APPROVED,Adventure,220,"[u'Charlton Heston', u'Yul Brynner', u'Anne Ba..."
...,...,...,...,...,...,...
974,8.1,Duck Soup,PASSED,Comedy,68,"[u'Groucho Marx', u'Harpo Marx', u'Chico Marx']"
975,8.4,The Kid,NOT RATED,Comedy,68,"[u'Charles Chaplin', u'Edna Purviance', u'Jack..."
976,8.1,The Cabinet of Dr. Caligari,UNRATED,Crime,67,"[u'Werner Krauss', u'Conrad Veidt', u'Friedric..."
977,8.0,Battleship Potemkin,UNRATED,History,66,"[u'Aleksandr Antonov', u'Vladimir Barsky', u'G..."
978,8.0,Freaks,UNRATED,Drama,64,"[u'Wallace Ford', u'Leila Hyams', u'Olga Bacla..."

In [4]:
longest_runtime = df["duration"].max()
shortest_runtime = df["duration"].min()
longest_runtime

242

In [5]:
shortest_runtime

64

In [6]:
result = df.loc[(df["genre"] == "Action") | (df["genre"] == "Crime")].reset_index(drop=True)
result

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
255,7.4,La Femme Nikita,R,Action,118,"[u'Anne Parillaud', u'Marc Duret', u'Patrick F..."
256,7.4,The Rock,R,Action,136,"[u'Sean Connery', u'Nicolas Cage', u'Ed Harris']"
257,7.4,Law Abiding Citizen,R,Crime,109,"[u'Gerard Butler', u'Jamie Foxx', u'Leslie Bibb']"
258,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
259,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [7]:
city_df = pd.DataFrame({'Name':['Amir','Shaibaz','Suhel','Fahad','Adil','Muzaffar','Shuaib','Asif','Awez','Muzammil'],
'City':['Georgia','California','Los Angeles','California','Los Angeles','Georgia','Los Angeles',
'California','Los Angeles','California']})
city_df

       Name         City
0      Amir      Georgia
1   Shaibaz   California
2     Suhel  Los Angeles
3     Fahad   California
4      Adil  Los Angeles
5  Muzaffar      Georgia
6    Shuaib  Los Angeles
7      Asif   California
8      Awez  Los Angeles
9  Muzammil   California

In [8]:
city_df.groupby(city_df["City"]).size().reset_index(name = "Number of people")

          City  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [9]:
df = pd.DataFrame({'col1':[1,4,3,4,5],
'col2':[4,5,6,7,8],
'col3':[7,8,9,0,1]})
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [10]:
result = df.drop([0,2,4])
result

   col1  col2  col3
1     4     5     8
3     4     7     0

In [1]:
user_input = input("Enter a string:")
for char in user_input:
    print(char)

A
b
h
i
s
h
e
k

In [2]:
string = "Machine Learning"
len(string)

16

In [3]:
string = "Machine Learning"
count1 = 0 
for i in string:
    count1 += 1
count1

16

In [4]:
sentence = "This is orange juice"
keyword = "orange"

if keyword in sentence:
    print("Orange is present in Sentence")
else:
    print("Orange is not present in sentence")

Orange is present in Sentence

In [5]:
input_string = input("Enter a string:")
vowels = "aeiou"
consonants = "bcdfghjklmnpqrstvwxyz"
digits = "0123456789"
vowel_count = 0 
consonant_count = 0
digit_count = 0
whitespace_count = 0
for i in input_string:
    if i.lower() in vowels:
        vowel_count += 1
    elif i.lower() in consonants:
        consonant_count += 1
    elif i in digits:
        digit_count += 1
    elif i.isspace():
        whitespace_count += 1
print("Vowels count : ", vowel_count)
print("Consonant count : ", consonant_count)
print("Digit count : ", digit_count)
print("Whitespace count : ", whitespace_count)

Vowels count :  3
Consonant count :  5
Digit count :  4
Whitespace count :  0

In [6]:
input_string = input("Enter a string:")
uppercase_count = 0 
lowercase_count = 0 
special_count = 0
numeric_count = 0

for i in input_string:
    if i.islower():
        lowercase_count += 1 
    elif i.isupper():
        uppercase_count += 1
    elif i.isdigit():
        numeric_count += 1
    else:
        special_count += 1
print("Upper case count: ", uppercase_count)
print("Lower case count: ",lowercase_count)
print("Special count: ",special_count)
print("Number of digits: ",numeric_count)

Upper case count:  1
Lower case count:  7
Special count:  1
Number of digits:  4

In [7]:
input_string = "Hello,have a good day"
vowels = "aeiouAEIOU"
new_string = ""
for i in input_string:
    if i.isalpha() and i in vowels:
        new_string += i 


print("original string:",input_string)
print("New string with consonants deleted:",new_string)

original string: Hello,have a good day
New string with consonants deleted: eoaeaooa

In [8]:
input_string = input("Enter a non empty string:")
index = int(input("Enter the index of the character to be removed"))

if index < 0 and index > len(input_string):
    print("Invalid index")
else:
    new_string = input_string[:index] + input_string[index+1:]
    print("Original string: ", input_string)
    print("New string with index removed: ", new_string)

Original string:  Abhishek
New string with index removed:  Abhshek

In [9]:
input_string = input("Enter a string:")
if len(input_string) < 2:
    print("String should have atleast 2 characters")
else:
    new_string = input_string[-1] + input_string[1:-1] + input_string[0]
    print("Original string: ", input_string)
    print("String with first and last characters exchanged: ", new_string)

Original string:  Abhishek
String with first and last characters exchanged:  kbhisheA

In [10]:
s = str(input("Enter a string:"))
word = ""
for i in s:
    word = i 
    count1 = s.count(word)
    print(f"In the given string {word} is been repeated {count1} times")

In the given string A is been repeated 1 times
In the given string b is been repeated 1 times
In the given string h is been repeated 2 times
In the given string i is been repeated 1 times
In the given string s is been repeated 1 times
In the given string h is been repeated 2 times
In the given string e is been repeated 1 times
In the given string k is been repeated 1 times
In the given string   is been repeated 1 times

In [11]:
s = str(input("Enter a string"))
ss = s.split()
for i in ss:
    if i in ss:
        ss.count(i)
        print(f"{i} : {s.count(i)}")
    else:
        print("Word is not repeated")

Abhishek : 1
Wakchaure : 1

In [12]:
input_string = input("Enter a string:")
result = input_string[-10:]
result

' Wakchaure'

In [13]:
def add(a,b):
    addition = a + b 
    return addition 
add(3,4)

7

In [1]:
input_string = input("Enter a string:")
uppercase_count = 0 
for char in input_string[:4]:
    if char.isupper():
        uppercase_count += 1
if uppercase_count >= 2:
    uppercase_string = input_string.upper()
    print("Uppercase string :",uppercase_string)
else:
    print("No conversion required")

Uppercase string : ABHISHEK WAKCHAURE

In [2]:
input_string = "This is a string with a newline.\n"

new_string = input_string.replace("\n","")
print("Original string :",input_string)
print("New string without newline :",new_string)

Original string : This is a string with a newline.

New string without newline : This is a string with a newline.

In [4]:
input_string = "32.054,23"

result = input_string.replace(",","*").replace(".",",").replace("*",".")
print("original string:",input_string)
print("new string:",result)

original string: 32.054,23
new string: 32,054.23

In [5]:
input_string = input("Enter a string:")
char_count = {}
for char in input_string:
    if char in char_count:
        print("First repeated character:",char)
        break
    char_count[char] = 1 
else:
    print("No repeated character found")

First repeated character: h

In [6]:
input_string = input("Enter a string:")
even_count = 0 
odd_count = 0
for char in input_string:
    if char.isdigit():
        num = int(char)
        if num%2 == 0:
            even_count += 1
        else:
            odd_count += 1
print("Even numbers count :",even_count)
print("odd number count :",odd_count)

Even numbers count : 4
odd number count : 5

In [7]:
input_string = input("Enter a string:")
if input_string.isdigit() == True:
    print("String contains only digits")
else:
    print("String contains alphabetes")

String contains alphabetes

In [8]:
a = "Abhishek"
list1 = list(a)
print(list1)
x = input()
if x in list1:
    list1.remove(x)
    print(list1)
else:
    print("Character not found")
print(list1)

['A', 'b', 'h', 'i', 's', 'h', 'e', 'k']
['A', 'b', 'i', 's', 'h', 'e', 'k']
['A', 'b', 'i', 's', 'h', 'e', 'k']

In [9]:
a = "Abhishek"
k = []
for i in a:
    if a.index(i)%2!=0:
        k.append(i)
print(k)

['b', 'i', 'k']

In [10]:
input_string = input("Enter a string:")
if len(input_string)%5==0:
    output_string = input_string[::-1]
    print(output_string)
else:
    print("Length is not multiple of 5")

Length is not multiple of 5

In [11]:
input_string = str(input("Enter a string:"))
empty = []
for i in input_string:
    empty = input_string[::-1]
print(empty)

kehsihbA

In [12]:
input_string = input("Enter a string")
empty = []
for i in input_string:
    empty = input_string.swapcase()
print(empty)

aBHISHEK

In [13]:
input_string = input("Enter a string:")
output_string = input_string.replace(" ","")
print(output_string)

AbhishekWakchaure

In [15]:
input_string = str(input("Enter a string:"))
output_string = []
for i in input_string:
    if i not in output_string:
        output_string.append(i)
print(output_string)

['A', 'b', 'h', 'i', 's', 'e', 'k', ' ', 'W', 'a', 'c', 'u', 'r']

In [17]:
num = eval(input("Enter a number:"))
for i in range(0 , num + 1):
    print(i*i)

0
1
4
9
16
25

In [18]:
num = eval(input("Enter a number:"))
for i in range(0 , num + 1):
    print(i*i*i)

0
1
4
9
16
25

In [19]:
n= eval(input("enter a number:"))
for i in range(2,n):
    if n % i == 0:
        print("Not prime")
        break
    else:
        print("Prime number")
        break

Prime number

In [20]:
input_string = str(input("Enter  a string:"))
for i in input_string:
    print(i)

A
b
h
i
s
h
e
k

In [1]:
list1 = [1,2,3,4,5]
max(list1)

5

In [2]:
list1 = [4,5,8,9,5,3,7]
list1.sort()
list1
max1 = list1[-1]
max1

9

In [3]:
list1 = [4,5,6,3,8]
list1.sort(reverse=True)
max1 = list1[0]
max1

8

In [4]:
list1 = [1,2,3,4,5]
list1[-1],list1[0] = list1[-1],list1[0]
list1

[1, 2, 3, 4, 5]

In [5]:
list1 = [1,2,3,4,5]
list1[-1]+list1[1:-1]+list1[:1]
list1

TypeError: unsupported operand type(s) for +: 'int' and 'list'

In [6]:
list1 = [1,2,3,4,5]
list1[0],list1[1] = list1[1],list1[0]
list1

[2, 1, 3, 4, 5]

In [7]:
list1 = [1,2,3,4,5]
list1.reverse()
list1

[5, 4, 3, 2, 1]

In [9]:
list1 = [1,2,3,4,5]
result = reversed(list1)
list(result)

[5, 4, 3, 2, 1]

In [10]:
list1 = [1,2,1,2,1,1,1,3,4,4]
list1.count(1)

5

In [11]:
list1 = [1,2,1,2,1,1,1,3,4,4]
num1 = 1 
count1 = 0 
for i in list1:
    if i == num1:
        count1 += 1 
print(count1)

5

In [12]:
list1 = [1,2,3,4,5]
sum1 = 0 
for i in list1:
    sum1 += i
sum1

15

In [13]:
list1 = [1,2,3,4,5]
mul = 1
for i in list1:
    mul *= i 
mul

120

In [14]:
list1 = [1,2,3,4,5]
len(list1)

5

In [16]:
list1 = [1,2,3,4,5]
print(range(len(list1)))

range(0, 5)

In [17]:
list1 = [1,2,3,4,5]
counter1 = 0 
for i in list1:
    counter1 += 1
counter1

5

In [18]:
list1 = []
num = int(input("How many numbers you want in the list:"))
for item in range(num):
    item = int(input("Enter the item you want in the list"))
    list1.append(item)
print("List1 :",list1)

num1 = int(input("Enter the number you want to remove from the list:"))
for i in range(len(list1)):
    if num1 == list1[i]:
        list1.remove(num1)
        print("Deleted number from list:",num1)
        print(list1)
        break
    else:
        print("Number not found in the list")

List1 : [1, 2, 3, 4, 5]
Number not found in the list
Number not found in the list
Deleted number from list: 3
[1, 2, 4, 5]

In [19]:
list1 = [2,5,6,12]
list2 = []
for i in list1:
    list2.append(i**2)
print("Original list: ", list1)
print("Square list: ", list2)

Original list:  [2, 5, 6, 12]
Square list:  [4, 25, 36, 144]

In [20]:
even_numbers = []
odd_numbers = []
for i in range(0,152):
    if i % 2 == 0:
        even_numbers.append(i)
    else:
        odd_numbers.append(i)
print("Even numbers: ", even_numbers)
print("*"*380)
print("Odd numbers: ", odd_numbers)

Even numbers:  [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150]
********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
Odd numbers:  [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127, 129, 131, 133, 135, 137, 139, 141, 143, 145, 147, 149, 151]

In [21]:
even_numbers = []
even_count = 0 
odd_numbers = []
odd_count = 0
for i in range(0,152):
    if i % 2 == 0:
        even_numbers.append(i)
        even_count += 1 
    else:
        odd_numbers.append(i)
        odd_count += 1 
print("Even numbers:", even_numbers)
print("*"*500)
print("Even count of numbers:", even_count)
print()
print()
print("Odd numbers:", odd_numbers)
print("*"*500)
print("Odd count of numbers:", odd_count)

Even numbers: [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150]
********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
Even count of numbers: 76


Odd numbers: [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127, 129, 131, 133, 135, 137, 139, 141, 143, 145, 147, 149, 151]
********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
Odd count of numbers: 76

In [22]:
l1=[1,2,3,"hello","welcome",4.12,5.35]
int_list = []
string_list = []
float_list = []
for i in l1:
    if type(i) == int:
        int_list.append(i)
    elif type(i) == float:
        float_list.append(i)
    elif type(i) == str:
        string_list.append(i)
print("Integer list: ", int_list)
print()
print("Float list: ", float_list)
print()
print("String list: ", string_list)

Integer list:  [1, 2, 3]

Float list:  [4.12, 5.35]

String list:  ['hello', 'welcome']

In [23]:
l1=[1,2,3,4]
l2=[4,5,6,7]
l1.extend(l2)
l1

[1, 2, 3, 4, 4, 5, 6, 7]

In [24]:
l1=[10, 2, 4, 5, 6, 2, 9, 1, 7, 5, 4, 11, 30]
result = sorted(l1,reverse=True)
result[2]

10

In [25]:
l1=[1,2,3,4,1,2,3,4]
l2 = {}
for i in l1:
    if i in l2:
        l2[i] += 1
    else:
        l2[i] = 1

print(l2)

{1: 2, 2: 2, 3: 2, 4: 2}

In [26]:
l1=[[1,2,3,4],1,2,3,4]
l2=[1,2,3,4]
if l2 in l1:
    print("L2 is subset of l1")
else:
    print("L2 is not a subset of l1")

L2 is subset of l1

In [27]:
l1=[10,20,30,40]
l2=[10,20,30,50]
result = set(l1) & set(l2)
result

{10, 20, 30}

In [28]:
l1=[[1,2,3],[4,5,6],[7,8,9]]
from itertools import chain 
result = list(chain(*l1))
result

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [29]:
tuple1 = (2,5,3,1,6,8,4)
result = sorted(tuple1)
result

[1, 2, 3, 4, 5, 6, 8]

In [30]:
l1 = [11, 33, 50]
for i in l1:
    print(i,end="")

113350

In [31]:
l1 = [1]
if l1 == []:
    print("List is empty")
else:
    print("List is not empty")

List is not empty

In [32]:
l1=[1,2,3]
l2=[4,5,6]
l1+l2

[1, 2, 3, 4, 5, 6]

In [33]:
l1=[1,2,3,1,2,3,4,5,6,4,5,6]
l1.count(1)

2

In [34]:
l1=[[1,2,3],[4,5,6],[7,8,9]]
from itertools import chain
result = list(chain(*l1))
result

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [4]:
key_value={'l':11,'o':89,'a':88,'d':42,'p':5}
result = dict(sorted(key_value.items(),key=lambda x : x[0]))
result

{'a': 88, 'd': 42, 'l': 11, 'o': 89, 'p': 5}

In [5]:
key_value={'l':11,'o':89,'a':88,'d':42,'p':5}
result = dict(sorted(key_value.items(),key=lambda x : x[0]))
result

{'a': 88, 'd': 42, 'l': 11, 'o': 89, 'p': 5}

In [6]:
key_value={'l':11,'o':89,'a':88,'d':42,'p':5}
result = dict(sorted(key_value.items(),key=lambda x : x[1]))
result

{'p': 5, 'l': 11, 'd': 42, 'a': 88, 'o': 89}

In [7]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = dict(sorted(dt.items(),key=lambda x : x[1]))
result

{'cc': 3, 'bb': 6, 'dd': 12, 'aa': 44}

In [8]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = dt.values()
sum(result)

65

In [9]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
sum1 = 0 
for i in dt.values():
    sum1 += i 
sum1

65

In [10]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
del test_dict["Arushi"]
test_dict

{'Mani': 21, 'Haritha': 21}

In [11]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
del test_dict["Mani"]
test_dict

{'Arushi': 22, 'Haritha': 21}

In [12]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
test_dict.pop("Arushi")
test_dict

{'Mani': 21, 'Haritha': 21}

In [13]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
test_dict.pop("Mani")
test_dict

{'Arushi': 22, 'Haritha': 21}

In [14]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
result = {**d1,**d2}
result

{'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32,
 'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12}

In [15]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
result = {**d2,**d1}
result

{'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12,
 'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32}

In [16]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
d1.update(d2)
d1

{'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32,
 'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12}

In [17]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
d2.update(d1)
d2

{'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12,
 'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32}

In [18]:
def calc(percent):
    if percent >= 90:
        return "A+"
    elif 80 <= percent < 90:
        return "A"
    elif 70 <= percent < 80:
        return "B"
    elif 60 <= percent < 70:
        return "C"
    elif 50 <= percent < 60:
        return "D"
    else:
        return "Fail"
    
def main():
    total_marks = 0
    no_of_subjects = int(input("Enter the number of subjects:"))

    for i in range(no_of_subjects):
        marks = eval(input("Enter the marks of the subject:"))
        total_marks += marks

    average_percent = total_marks / no_of_subjects
    grade = calc(average_percent)
    print(f"Percentage recieved by the student is : {average_percent}")
    print(f"Grade recieved by Student is :{grade}")

if __name__ == "__main__":
    main()

Percentage recieved by the student is : 50.0
Grade recieved by Student is :D

In [19]:
words = ["listen", "silent", "enlist", "hello", "world", "act", "cat", "dog", "god"]
anagram_dict = {}
for word in words:
    sorted_word = " ".join(sorted(word))

    if sorted_word in anagram_dict:
        anagram_dict[sorted_word].append(word)
    else:
        anagram_dict[sorted_word] = [word]

anagram_dict

{'e i l n s t': ['listen', 'silent', 'enlist'],
 'e h l l o': ['hello'],
 'd l o r w': ['world'],
 'a c t': ['act', 'cat'],
 'd g o': ['dog', 'god']}

In [20]:
words = ["listen", "silent", "enlist", "hello", "world", "act", "cat", "dog", "god"]
anagram_dict = {}
for word in words:
    sorted_word = " ".join(sorted(word))

    if sorted_word in anagram_dict:
        anagram_dict[sorted_word].append(word)
    else:
        anagram_dict[sorted_word] = [word]
anagram_dict

{'e i l n s t': ['listen', 'silent', 'enlist'],
 'e h l l o': ['hello'],
 'd l o r w': ['world'],
 'a c t': ['act', 'cat'],
 'd g o': ['dog', 'god']}

In [21]:
def check_bin(num1,num2):
    binary_num1 = bin(num1)[2:]
    binary_num2 = bin(num2)[2:]

    return sorted(binary_num1) == sorted(binary_num2)

num1 = 10 
num2 = 20 
if check_bin(num1,num2):
    print(f"The binary representation of {num1}, {num2} are anagrams")
else:
    print(f"The binary representation of {num1}, {num2} are not anagrams")

The binary representation of 10, 20 are not anagrams

In [22]:
from collections import Counter
def largest(words):
    words_count = Counter("".join(sorted(word)) for word in words)

    result = max(words_count.values(),default=0)

    return result

word_list = ["listen", "silent", "enlist", "dog", "god", "good"]
final = largest(word_list)
final

3

In [23]:
from collections import Counter
def largest(words):
    words_count = Counter("".join(sorted(word)) for word in words)

    result = max(words_count.values(),default=0)

    return result
word_list = ["listen", "silent", "enlist", "dog", "god", "good"]
final = largest(word_list)
final

3

In [24]:
list1 = [1, 1, 1, 5, 5, 3, 1, 3, 3, 1,4, 4, 4, 2, 2, 2, 2]
freq = {}
for i in list1:
    if i in freq:
        freq[i] += 1
    else:
        freq[i] = 1

freq

{1: 5, 5: 2, 3: 3, 4: 3, 2: 4}

In [25]:
list1 = [1, 1, 1, 5, 5, 3, 1, 3, 3, 1,4, 4, 4, 2, 2, 2, 2]
freq = {}
for i in list1:
    if i in freq:
        freq[i] += 1
    else:
        freq[i] = 1
freq

{1: 5, 5: 2, 3: 3, 4: 3, 2: 4}

In [26]:
tups = [("akash", 10), ("gaurav", 12), ("anand", 14), 
    ("suraj", 20), ("akhil", 25), ("ashish", 30)]
result = dict(tups)
result

{'akash': 10,
 'gaurav': 12,
 'anand': 14,
 'suraj': 20,
 'akhil': 25,
 'ashish': 30}

In [27]:
numbers = [2, 3, 4, 5, 6]
result = [(num , num ** 3) for num in numbers]
result

[(2, 8), (3, 27), (4, 64), (5, 125), (6, 216)]

In [30]:
numbers = [2, 3, 4, 5, 6]
result = [(num , num ** 3)for num in numbers]
result

[(2, 8), (3, 27), (4, 64), (5, 125), (6, 216)]

In [31]:
tuples_list = [(2, 8), (3, 27), (1, 1), (5, 125), (4, 64)]

result = sorted(tuples_list , key=lambda x : x[1])
result

[(1, 1), (2, 8), (3, 27), (4, 64), (5, 125)]

In [32]:
tuples_list = [(2, 8), (3, 27), (1, 1), (5, 125), (4, 64)]

result = sorted(tuples_list , key=lambda x : x[0])
result

[(1, 1), (2, 8), (3, 27), (4, 64), (5, 125)]

In [1]:
subject_marks = [("English",88) , ("Science",90) , ("Maths",97) , ("Social sciences",82)]
result = sorted(subject_marks,key=lambda x : x[1])
result

[('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]

In [2]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
result = sorted(list1 , key=lambda x : x["age"])
result

[{'name': 'Nikhil', 'age': 19},
 {'name': 'Nandini', 'age': 20},
 {'name': 'Manjeet', 'age': 20}]

In [3]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
result = sorted(list1,key=lambda x : (x["age"],x["name"]))
result

[{'name': 'Nikhil', 'age': 19},
 {'name': 'Manjeet', 'age': 20},
 {'name': 'Nandini', 'age': 20}]

In [4]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
result = sorted(list1,key=lambda x : x["age"],reverse=True)
result

[{'name': 'Nandini', 'age': 20},
 {'name': 'Manjeet', 'age': 20},
 {'name': 'Nikhil', 'age': 19}]

In [5]:
input_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [(lambda x : x**2) (num) for num in input_numbers]
result

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [6]:
input_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [(lambda x : x**3)(num) for num in input_numbers]
result

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [7]:
result = lambda x : True if x.startswith("P") else False
print(result("Python"))

True

In [8]:
result = lambda x : True if x.startswith("P") else False
print(result("Abhishek"))

False

In [9]:
result = (lambda string : string.isdigit())(string = "1234")
result

True

In [10]:
result = (lambda string : string.isnumeric())(string = "1234")
result

True

In [11]:
result = (lambda string : string.isdecimal())(string = "1234")
result

True

In [12]:
n = 9 
f1 = 0 
f2 = 1 
print(f1,f2,end=" ")
for i in range(2,n):
    f3 = f1 + f2
    f1,f2 = f2,f3
    print(f3,end=" ")

0 1 1 2 3 5 8 13 21

In [13]:
n = 10 
f1 = 0 
f2 = 1 
print(f1,f2,end=" ")
for i in range(2,n):
    f3 = f1 + f2
    f1,f2 = f2,f3
    print(f3,end=" ")

0 1 1 2 3 5 8 13 21 34

In [14]:
list1 = [1,2,3,4]
list2 = [3,4,5,6]
result = list(filter(lambda x : x in list1 ,list2))
result

[3, 4]

In [16]:
list1 = [-1,2,-3,5,7,8,9,-10]
result = (lambda list1 : [x for x in list1 if x >= 0] + [x for x in list1 if x < 0])
result(list1)

[2, 5, 7, 8, 9, -1, -3, -10]

In [17]:
list1 = [-1,2,-3,5,7,8,9,-10]
result = (lambda list1 : [x for x in list1 if x >= 0] + [x for x in list1 if x < 0])
result(list1)

[2, 5, 7, 8, 9, -1, -3, -10]

In [19]:
array_nums = [1,2,3,5,7,8,9,10]
result = len(list(filter(lambda x : (x%2!=0) , array_nums)) )
result

5

In [20]:
array_nums = [1,2,3,5,7,8,9,10]
result = len(list(filter(lambda x : (x%2==0) , array_nums)) )
result

3

In [21]:
list1 = [1,2,3]
list2 = [4,5,6]
result = list(map(lambda x1,x2 : x1+x2 ,list1,list2))
result

[5, 7, 9]

In [22]:
list1 = [13,26,38,39,57,15,17]
result = list(filter(lambda x : (x%13==0 or x%19==0),list1))
result

[13, 26, 38, 39, 57]

In [23]:
texts = ["php" , "w3r" , "Python" , "abcd" ,"Java" , "aaa"]
result = list(filter(lambda x : (x == "".join(reversed(x))),texts))
result

['php', 'aaa']

In [24]:
from collections import Counter
texts = ["bcda","abce","cbda","cbea","adcb"]
str1 = "abcd"
result = list(filter(lambda x : (Counter(str1) == Counter(x)),texts))
result

['bcda', 'cbda', 'adcb']

In [25]:
list1 = [2,3,4,5]
result = list(map(lambda x : x*5 ,list1))
result

[10, 15, 20, 25]

In [27]:
list1 = [-1,-2,3,4]
result = list(filter(lambda list1 : list1 > 0,list1))
final = sum(result)
final

7

In [28]:
list1 = [-1,-2,3,4]
result = list(filter(lambda list1 : list1 < 0,list1 ))
final = sum(result)
final

-3

In [29]:
result = lambda list1 : list1 == sorted(list1)
sample_list_1 = [1, 2, 3, 4, 5]
result(sample_list_1)

True

In [30]:
result = lambda list1 : list1 == sorted(list1)
sample_list_2 = [5, 3, 1, 4, 2]
result(sample_list_2)

False

In [31]:
list1 = [1,2,3,4,5,6,7,8,9,10]
list2 = [2,4,6,8]
result = list(filter(lambda x : x not in list2,list1))
result

[1, 3, 5, 7, 9, 10]

In [32]:
tuple_str = (("223","ABCD","33") , ("1416","EFGH","55") , ("2345","WERT","34"))
result = tuple(map(lambda x : (int(x[0]) , int(x[2])),tuple_str))
result

((223, 33), (1416, 55), (2345, 34))

In [33]:
nums = [3,4,5,8,0,3,8,5,0,3,1,5,2,3,4,2]
result = dict(map(lambda x : (x,list(nums).count(x)),nums))
result

{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}

In [34]:
nums = [3,4,5,8,0,3,8,5,0,3,1,5,2,3,4,2]
result = dict(map(lambda x : (x,list(nums).count(x)),nums))
result

{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}

In [35]:
l1 = [1,2,3]
l2 = [4,5,6]
l3 = [7,8,9]
result = list(map(lambda x1,x2,x3 : x1+x2+x3,l1,l2,l3))
result

[12, 15, 18]

In [36]:
l1 = ["yellow","blue","tricolor"]
result = list(map(list,l1))
result

[['y', 'e', 'l', 'l', 'o', 'w'],
 ['b', 'l', 'u', 'e'],
 ['t', 'r', 'i', 'c', 'o', 'l', 'o', 'r']]

In [37]:
l1 = [12,15,18]
result = list(map(lambda x : x**2,l1))
result

[144, 225, 324]

In [38]:
list1 = [1, 2, 3, 4, 5]
list2 = [5, 4, 3, 2, 1]

result = list(map(lambda x,y : x+y,list1,list2))
result

[6, 6, 6, 6, 6]

In [39]:
list1 = [1, 2, 3, 4, 5]
list2 = [5, 4, 3, 2, 1]
result = list(map(lambda x,y : x-y,list1,list2))
result

[-4, -2, 0, 2, 4]

In [40]:
int_list = [1, 2, 3, 4, 5]

# Given tuple of integers
int_tuple = (6, 7, 8, 9, 10)

result = list(map(lambda x : str(x),int_list))
result

['1', '2', '3', '4', '5']

In [41]:
result = list(map(lambda x : str(x),int_tuple))
result

['6', '7', '8', '9', '10']

In [42]:
num_array = [1, 2, 3, 4, 5]

result = sum(map(lambda x : x,num_array))
result

15

In [43]:
list1 = [1, 2, 3, 4, 5]
list2 = [1, 2, 4, 8, 9]

result = sum(list(map(lambda x,y : x==y,list1,list2)))
result

2

In [44]:
str1 = ["python","machine","learning"]
result = list(map(list,str1))
result

[['p', 'y', 't', 'h', 'o', 'n'],
 ['m', 'a', 'c', 'h', 'i', 'n', 'e'],
 ['l', 'e', 'a', 'r', 'n', 'i', 'n', 'g']]

In [45]:
list_tup = [("python","machine"),("learning","data science")]
result = list(map(" ".join,list_tup))
result

['python machine', 'learning data science']

In [46]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x not in l2,l1))
result

[3]

In [47]:
from nltk.corpus import stopwords
stopword_list = stopwords.words("english")
result = list(filter(lambda x : x.lower() not in stopword_list,string))
result

AttributeError: partially initialized module 'nltk' has no attribute 'internals' (most likely due to a circular import)

In [48]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x in l1,l2))
result

[1, 2]

In [49]:
l1 = [1,2,3]
result = list(filter(lambda x : x%2!=0,l1))
result

[1, 3]

In [50]:
l1 = [1,2,3]
result = list(filter(lambda x : x%2==0,l1))
result

[2]

In [3]:
with open("Abhi.txt.txt","r") as f:
    result = f.read()
    print(result)
    f.close()

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [4]:
with open("Abhi.txt.txt","r") as f:
    result = f.readline()
    print(result)
    f.close()

Data Science:

In [5]:
text = """1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing"""
with open("Abhi.txt.txt","a") as f:
    f.write(text)
    f.close()

In [7]:
with open("Abhi.txt.txt","r") as f:
    result = f.read(-2)
    print(result)
    f.close()

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [9]:
with open("Abhi.txt.txt","r")as f:
    result = f.readlines()
    final = result[-2:]
    print(final)

[' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']

In [10]:
with open("Abhi.txt.txt","r")as f:
    result = f.readlines()
    print(result)
    f.close()

['Data Science:\n', '    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge\n', '    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of \n', '    application domains.1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']

In [11]:
with open("Abhi.txt.txt","r")as f:
    result = f.readlines()
    print(len(result))
    f.close()

10

In [12]:
with open("Abhi.txt.txt","r")as f:
    result = f.read()
    print(len(result))
    f.close()

474

In [13]:
with open("Abhi","r")as f:
    result = f.read()
    print(result)
    f.close()

PermissionError: [Errno 13] Permission denied: 'Abhi'

In [14]:
import shutil
shutil.copy("Abhi.txt.txt","Sample.txt")
with open("Sample.txt","r")as f:
    result = f.read()
    print(result)
    f.close()

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [15]:
from datetime import datetime

current_datetime = datetime.now()
print("Current datetime :",current_datetime)

current_year = current_datetime.year
print("Current year :",current_year)

result = current_datetime.strftime("%B")
print("Month of the year:",result)

result = current_datetime.strftime("%U")
print("Week number of the year:",result)

result = current_datetime.strftime("%A")
print("Weekday of the week:",result)

result = current_datetime.strftime("%j")
print("Day of the year:",result)

result = current_datetime.strftime("%d")
print("Day of the month:",result)

Current datetime : 2024-04-30 08:36:05.017130
Current year : 2024
Month of the year: April
Week number of the year: 17
Weekday of the week: Tuesday
Day of the year: 121
Day of the month: 30

In [16]:
year = int(input("Enter a year:"))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(f"{year} is a leap year")
else:
    print(f"{year} is not a leap year")

2004 is a leap year

In [18]:
date_format = "jan 1 2014 2:43PM"
date1 = "%b %d %Y %I:%M%p"

result = datetime.strptime(date_format, date1)
print(result)

2014-01-01 14:43:00

In [20]:
from datetime import timedelta
current_datetime = datetime.now()
result = current_datetime + timedelta(days=5)
print(f"Subtracted five days from {current_datetime} is : {result}")

Subtracted five days from 2024-04-30 08:53:51.214100 is : 2024-05-05 08:53:51.214100

In [21]:
result = datetime.now() + timedelta(days=-1)
print("Date of Yesterday:",result)
result = datetime.now() + timedelta(days=0)
print("Date of Today:",result)
result = datetime.now() + timedelta(days=+1)
print("Date of tommorrow:",result)

Date of Yesterday: 2024-04-29 08:57:04.568239
Date of Today: 2024-04-30 08:57:04.568239
Date of tommorrow: 2024-05-01 08:57:04.568239

In [22]:
current_datetime = datetime.now().date()
print(current_datetime)

2024-04-30

In [23]:
for i in range(5):
    result = current_datetime + timedelta(days=i)
    print("Next 5 days starting from today:",result)

Next 5 days starting from today: 2024-04-30
Next 5 days starting from today: 2024-05-01
Next 5 days starting from today: 2024-05-02
Next 5 days starting from today: 2024-05-03
Next 5 days starting from today: 2024-05-04

In [24]:
current_datetime = datetime.now()
print("Before time is :",current_datetime)
result = current_datetime.replace(microsecond=0)
print("After time is :",result)

Before time is : 2024-04-30 09:03:42.581864
After time is : 2024-04-30 09:03:42

In [25]:
random_day = datetime(2024,8,12)
print(random_day)
result = random_day.strftime("%a %d %b %Y %U")
print(result)

2024-08-12 00:00:00
Mon 12 Aug 2024 32

In [26]:
import os 
os.rename("Abhi.txt.txt","Abhi.txt")

In [27]:
os.getcwd()

'd:\\abhi python\\Python hands on\\Python-Hands-ON'

In [28]:
os.listdir()

['.git',
 'Abhi',
 'Abhi.txt',
 'adaboost.ipynb',
 'Adaboost_Ass.ipynb',
 'ai4i2020.csv',
 'Ann_implementation.ipynb',
 'Assignment_1.ipynb',
 'Assignment_10.ipynb',
 'Assignment_11.ipynb',
 'Assignment_12.ipynb',
 'Assignment_13_LinearR.ipynb',
 'Assignment_2.ipynb',
 'Assignment_3.ipynb',
 'Assignment_4.ipynb',
 'Assignment_6.ipynb',
 'Assignment_7.ipynb',
 'Assignment_8.ipynb',
 'Assignment_9.ipynb',
 'Assignment_DT.ipynb',
 'Assignment_KNN.ipynb',
 'autos_dataset.csv',
 'Bangalore.ipynb',
 'Bengaluru_House_Data.csv',
 'Book2.csv',
 'Boston.csv',
 'cardio_alco.csv',
 'cardio_base.csv',
 'CNN.ipynb',
 'CNN_proj_explanation.ipynb',
 'CNN_rev.ipynb',
 'Copy1.txt',
 'Country_clusters.csv',
 'covid_data.csv',
 'DataFrame.csv',
 'DataFrame.xlsx',
 'dataset_es_train.csv',
 'Decision tree HYP_Tuning.png',
 'Decision Tree.png',
 'DecisionTree.ipynb',
 'Decision_Tree.png',
 'Decision_Tree_HYP.png',
 'Decision_Tree_REG_WithoutHYP.png',
 'Decision_TRee_Working.ipynb',
 'Deep_Learning.ipynb',
 'Deep_Learning_rev.ipynb',
 'DegreeofFreedom.png',
 'diabetes.csv',
 'Dim_red_tech.ipynb',
 'DRT.REV.ipynb',
 'DT_multiclass_clf.ipynb',
 'DT_Multiclass_clf_withoutHYP.png',
 'DT_Pruning.ipynb',
 'DT_pruning_revision.ipynb',
 'DT_regression.ipynb',
 'Elbow_method.png',
 'Emp_data.csv',
 'Emp_Records.xlsx',
 'emp_test1.csv',
 'heart.csv',
 'iframe_figures',
 'Imp_Interview_approach.ipynb',
 'IMP_Questions.ipynb',
 'Interview_questions.ipynb',
 'Iris.csv',
 'kmeans_clustering.ipynb',
 'KNN_all_clustering.ipynb',
 'KNN_classification.ipynb',
 'KNN_Clustering_Ass.ipynb',
 'Knn_Imputer.ipynb',
 'KNN_Regression.ipynb',
 'KNN_revision.ipynb',
 'Linear_reg_assignment.ipynb',
 'Linear_reg_theory.ipynb',
 'loan_data.csv',
 'Logistic_reg_assignment.ipynb',
 'movies_data.csv',
 'Naive_Bayes.ipynb',
 'Naive_Bayes_Ass.ipynb',
 'neg',
 'NLP.ipynb',
 'NLP_mini_project',
 'NLP_rev.ipynb',
 'PCA.ipynb',
 'PCA_rev.ipynb',
 'pos',
 'Predictive maintenance.ipynb',
 'Project.ipynb',
 'Prompt_Engineering.ipynb',
 'Python 1.ipynb',
 'python 10.ipynb',
 'python 11.ipynb',
 'python 12.ipynb',
 'python 2.ipynb',
 'python 3.ipynb',
 'python 4.ipynb',
 'python 5.ipynb',
 'python 6.ipynb',
 'python 7.ipynb',
 'python 8.ipynb',
 'python 9.ipynb',
 'Python_13.ipynb',
 'Python_14.ipynb',
 'Python_15.ipynb',
 'python_16.ipynb',
 'python_17.ipynb',
 'python_18.ipynb',
 'Random_forest_clf.ipynb',
 'README.md',
 'Sample.txt',
 'Sample.xls',
 'Sample1.xlsx',
 'Sampling.ipynb',
 'Scoring.png',
 'Social_Network_Ads.csv',
 'student.csv',
 'Support_vector_machine.ipynb',
 'SVM_Assignment.ipynb',
 'titanic.csv',
 'Train.csv',
 'Wakchaure.txt',
 'weather.csv',
 'weather1.csv',
 'word2vec.model']

In [29]:
try:
    print("Hello")
except:
    print("I am Here")

Hello

In [1]:
string = "Python and Machine Learning 7741 is syllabus of Data Science."
import re 
result = re.findall("[a-zA-Z0-9]", string)
result

['P',
 'y',
 't',
 'h',
 'o',
 'n',
 'a',
 'n',
 'd',
 'M',
 'a',
 'c',
 'h',
 'i',
 'n',
 'e',
 'L',
 'e',
 'a',
 'r',
 'n',
 'i',
 'n',
 'g',
 '7',
 '7',
 '4',
 '1',
 'i',
 's',
 's',
 'y',
 'l',
 'l',
 'a',
 'b',
 'u',
 's',
 'o',
 'f',
 'D',
 'a',
 't',
 'a',
 'S',
 'c',
 'i',
 'e',
 'n',
 'c',
 'e']

In [2]:
string = "Python and Machine Learning is syllabus of data science and deep learning."
result = re.split(r"and",string)
result

['Python ',
 ' Machine Learning is syllabus of data science ',
 ' deep learning.']

In [3]:
str1='Python and Data Science Batch 2023'
result = re.findall(r"\bab*[a-z]*\b",str1)
result

['and']

In [4]:
sample_string = "There are 123 45 678 90 2345 67 12 345 6789 0123 three-digit"
result = re.findall(r"\b\d{3}\s\d{2}\b",sample_string)
result

['123 45', '678 90']

In [5]:
str1= "python and data pytthon science pythonnn pyyth annd pythh"
result = re.findall(r"p+",str1)
result

['p', 'p', 'p', 'p', 'p']

In [6]:
str1 = 'We can write INFORM in lowercase as inform'
result = re.findall(r"INFORM|inform",str1)
if result:
    print("String is present")
else:
    print("String is not present")

String is present

In [7]:
str1= " data science and pytthon science abbbss and pyt"
result = re.findall(r"py?",str1)
result

['py', 'py']

In [8]:
str1= "python and data pbbbtthon science pytbbbonnn and pyt"
result = re.findall(r"\b\w*b{3}\w*\b",str1)
result

['pbbbtthon', 'pytbbbonnn']

In [9]:
str1= "abbbs and data abbbsolutely science abbrivation and pyt"
result = re.findall(r"\b\w*b{2,3}\w*\b",str1)
result

['abbbs', 'abbbsolutely', 'abbrivation']

In [10]:
str1= "abbbs and data abbbsolutely or science an abbrivation and pyt"
result = re.findall(r"\b\w{3,5}\b",str1)
result

['abbbs', 'and', 'data', 'and', 'pyt']

In [11]:
str1= "abbbs and data abbbsolutely or science_ an abbrivation_ and pyt_"
result = re.findall(r"[a-z]+[_]",str1)
result

['science_', 'abbrivation_', 'pyt_']

In [12]:
str1= "Abbbs and Data Abbbsolutely or Science_ an Abbrivation_ and pyt_"
result = re.findall(r"[A-Z][a-z]+",str1)
result

['Abbbs', 'Data', 'Abbbsolutely', 'Science', 'Abbrivation']

In [13]:
str1= "data absorb Science and Abbrivation and pyt"
result = re.findall(r"\ba.+b\b",str1)
result

['absorb']

In [14]:
str1 = 'Suceess is a jurney not a desti9nation.'
result = re.findall(r"Suceess",str1)
result

['Suceess']

In [15]:
str1 = 'new begening of LIFE .'
result = re.findall("LIFE .",str1)
result

['LIFE .']

In [17]:
str1 = "today is the very lazy day"
result = re.findall(r"\b\w*z\w\b",str1)
result

['lazy']

In [18]:
str1 = "today is the very lazy day"
result = re.findall(r"\b\w*z\w\b",str1)
result

['lazy']

In [19]:
str1 = "we have a lazy cat"
result = re.findall(r"[a-y]*z[a-y]",str1)
result

['lazy']

In [20]:
str1 = "RudrANSHI_12345_wadekar"
result = re.findall(r"\w{1,}",str1)
result

['RudrANSHI_12345_wadekar']

In [22]:
str1 = "9821 maya"
result = re.findall(r"^\d*",str1)
result

['9821']

In [23]:
ip_adress="216.008.904.196"
result = re.sub(r"\b0.","",ip_adress)
result

'216.8.904.196'

In [26]:
str1="Python is required for data science version 3.2"
result = re.findall(r"\d..\b",str1)
result

['3.2']

In [27]:
str1 = "Exercises number 1, 12, 13, and 345 are important"
result = re.findall(r"[0-9]+",str1)
result

['1', '12', '13', '345']

In [29]:
Sample_text ='The quick brown fox jumps over the lazy dog.'
Searched_words ='fox', 'dog', 'horse'
for word in Searched_words:
    result = re.findall(word,Sample_text)
    print(result)

['fox']
['dog']
[]

In [30]:
sample_text ='The quick brown fox jumps over the lazy dog.'
result = re.search("fox",sample_text)
result

In [31]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
result

['exercises', 'exercises', 'exercises']

In [32]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
print("The occurence of the string:",len(result))
result = re.search(r"exercises",Sample_text)
print(f"The position of the substring starts from {result.start()} and end {result.end()}")

The occurence of the string: 3
The position of the substring starts from 7 and end 16

In [33]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","_",str1)
print(result)
result = re.sub(r"[_]","",result)
result

The_quick_brown_fox_jumps_over_the_lazy_dog.

'Thequickbrownfoxjumpsoverthelazydog.'

In [34]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","",str1)
result

'Thequickbrownfoxjumpsoverthelazydog.'

In [35]:
str1= "python and data science pythonnn"
result = re.findall(r"\b[p]\w*",str1)
result

['python', 'pythonnn']

In [36]:
str1= "data science and python learning with begening every evening "
result = re.findall(r"\b[a,e]\w*",str1)
result

['and', 'every', 'evening']

In [37]:
str1 = "i am mrunal chaudhari ,my age is 24"
result = re.search(r"\d",str1)
result

In [38]:
text ="""Python. is a general,purpose, interpreted."""
result = re.sub(r"[., ]",":",text)
result

'Python::is:a:general:purpose::interpreted:'

In [39]:
text ="""Python., is a general purpose interpreted."""
result = re.sub(r"[., ]{2}",":",text)
result

'Python: is a general purpose interpreted.'

In [40]:
text ="""123 Python is a general-purpose, interpreted,
high-level programming language popularly used for
website development, data analytics 78 and automation."""

result = re.findall(r"\b\D{3,5}\b", text)
result

[' is a', 'high-', 'level', ' used', ' for\n', 'data ', ' and ']